{
    "item":[
     {
       "name": "Breaks",
       "desc1": "car stop system",
       "desc2": "are disk, drum and so on",
       "fullDesc": "Тормозная система предназначена для снижения скорости движения и/или остановки транспортного средства или механизма. Она также позволяет удерживать транспортное средство от самопроизвольного движения во время покоя. Рабочая тормозная система\n\nРабочая тормозная система служит для регулирования скорости движения транспортного средства и его остановки. Тормозные системы также делятся по типам приводов: механический, гидравлический, пневматический и комбинированный. Так, на легковых машинах в наше время в основном используются гидравлический привод, а на грузовых пневматический и комбинированный. Для уменьшения прикладываемого усилия на педаль тормоза устанавливается вакуумный или пневматический усилитель тормозов.\nЗапасная тормозная система\n\nЗапасная тормозная система служит для остановки транспортного средства при выходе из строя рабочей тормозной системы.\nСтояночная тормозная система\nОсновная статья: Стояночный тормоз\n\nСтояночная тормозная система служит для удержания транспортного средства неподвижно на дороге. Используется не только на стоянке, она также применяется для предотвращения скатывания транспортного средства назад при старте на подъёме.\n\nСтояночная тормозная система приводится в действие с помощью рычага стояночного тормоза, как правило, затормаживает задние колёса. Как правило, на легковых автомобилях проложен тросовый привод к задним тормозным механизмам, на грузовых автомобилях с воздушными тормозами на задних осях установлены энергоаккумуляторы — тормозные камеры с установленными внутри пружинами, за счёт которых колёса удерживаются заторможенными, а при подаче воздуха пружины сжимаются и стояночный тормоз отпускает.\nВспомогательная тормозная система\nВспомогательная тормозная система служит для длительного поддержания постоянной скорости (на затяжных спусках) за счёт торможения двигателем, что достигается прекращением подачи топлива в цилиндры двигателя и перекрытием выпускных трубопроводов. ",
       "image1": "breaks1",
       "image2": "breaks2",
       "link": "https://ru.wikipedia.org/wiki/%D0%A2%D0%BE%D1%80%D0%BC%D0%BE%D0%B7%D0%BD%D0%B0%D1%8F_%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D0%B0#%D0%A1%D1%81%D1%8B%D0%BB%D0%BA%D0%B8"
     },
     {
       "name": "Engine",
       "desc1": "An internal combustion engine",
       "desc2": "are reactive, v-type, in-line, opposite, rotary",
       "fullDesc": "An internal combustion engine (ICE) is a heat engine where the combustion of a fuel occurs with an oxidizer (usually air) in a combustion chamber that is an integral part of the working fluid flow circuit. In an internal combustion engine, the expansion of the high-temperature and high-pressure gases produced by combustion applies direct force to some component of the engine. The force is applied typically to pistons, turbine blades, rotor or a nozzle. This force moves the component over a distance, transforming chemical energy into useful mechanical energy.\n\nThe first commercially successful internal combustion engine was created by Étienne Lenoir around 1859[1] and the first modern internal combustion engine was created in 1876 by Nikolaus Otto (see Otto engine).\n\nThe term internal combustion engine usually refers to an engine in which combustion is intermittent, such as the more familiar four-stroke and two-stroke piston engines, along with variants, such as the six-stroke piston engine and the Wankel rotary engine. A second class of internal combustion engines use continuous combustion: gas turbines, jet engines and most rocket engines, each of which are internal combustion engines on the same principle as previously described.[1][2] Firearms are also a form of internal combustion engine.[2]\n\nIn contrast, in external combustion engines, such as steam or Stirling engines, energy is delivered to a working fluid not consisting of, mixed with, or contaminated by combustion products. Working fluids can be air, hot water, pressurized water or even liquid sodium, heated in a boiler. ICEs are usually powered by energy-dense fuels such as gasoline or diesel, liquids derived from fossil fuels. While there are many stationary applications, most ICEs are used in mobile applications and are the dominant power supply for vehicles such as cars, aircraft, and boats.\n\nTypically an ICE is fed with fossil fuels like natural gas or petroleum products such as gasoline, diesel fuel or fuel oil. There is a growing usage of renewable fuels like biodiesel for compression ignition engines and bioethanol or methanol for spark ignition engines. Hydrogen is sometimes used, and can be obtained from either fossil fuels or renewable energy.",
       "image1": "engine1",
       "image2": "engine2",
       "link": "https://en.wikipedia.org/wiki/Internal_combustion_engine"
     },
     {
       "name": "Exhaust system",
       "desc1": "An exhaust system is usually piping used to guide reaction exhaust gases away from a controlled combustion inside an engine or stove",
       "desc2": "for exhaust gas outlet",
       "fullDesc": "An exhaust pipe must be carefully designed to carry toxic and/or noxious gases away from the users of the machine. Indoor generators and furnaces can quickly fill an enclosed space with poisonous exhaust gases such as hydrocarbons, carbon monoxide and nitrogen oxides,[1] if they are not properly vented to the outdoors. Also, the gases from most types of machines are very hot; the pipe must be heat-resistant, and it must not pass through or near anything that can burn or can be damaged by heat. A chimney serves as an exhaust pipe in a stationary structure. For the internal combustion engine it is important to have the exhaust system 'tuned' (refer to tuned exhaust) for optimal efficiency. Also this should meet the regulation norms maintained in each country. In China, China 5; In European countries, EURO 5; In India, BS-4, etc.,\nMotorcycles\nExhaust piping and silencer on a Ducati Monster motorcycle\n\nIn most motorcycles all or most of the exhaust system is visible and may be chrome plated as a display feature. Aftermarket exhausts may be made from steel, aluminium, titanium, or carbon fiber.\n\nMotorcycle exhausts come in many varieties depending on the type of engine and its intended use. A twin cylinder may flow its exhaust into separate exhaust sections, such as seen in the Kawasaki EX250 (also known as the Ninja 250 in the US, or the GPX 250). Or, they may flow into a single exhaust section known as a two-into-one (2-1). Larger engines that come with 4 cylinders, such as Japanese super-sport or super-bikes (such the Kawasaki ZX series, Honda's CBR series, Yamaha's YZF series, also known as R6 and R1, and Suzuki's GSX-R series) often come with a twin exhaust system. A 'full system' may be bought as an aftermarket accessory, also called a 4-2-1 or 4-1, depending on its layout. In the past, these bikes would come standard with a single exhaust, as seen on the Kawasaki ZX-6R 2000 and 2001 models. However, EU noise and pollution regulations have generally stopped this practice, forcing companies to use other methods to increase performance of the motorcycle.\n\nA 2-stroke exhaust can be made to be quieter than 70dBa at 6000 rpm without sacrificing any power gains. The latest generations of 4-stroke street motorcycle engines that can come close to a 2T in redline RPM but still having the extra weight and inertia of cams and valves make the differences in being 'cleaner burning' negligible, with the decreased engine service life to be expected, while also having the sound of a 4T exhaust carrying for miles in many cases. Additionally, 'the nature of the beast' is that a 4T exhaust note above 6000 rpm is unduly harsh to the human ear.\nTrucks\n\nIn many trucks / lorries all or most of the exhaust system is visible. Often in such trucks the silencer is surrounded by a perforated metal sheath to avoid people getting burnt touching the hot silencer. This sheath may be chrome plated as a display feature. Part of the pipe between the engine and the silencer is often flexible metal industrial ducting, which helps to avoid vibration from the engine being transferred into the exhaust system. Sometimes a large diesel exhaust pipe is vertical, to blow the hot noxious gas well away from people; in such cases the end of the exhaust pipe often has a hinged metal flap to stop debris, birds and rainwater from falling inside.\nTwo-stroke engines\nIn a two-stroke engine, such as that used on dirt bikes, a bulge in the exhaust pipe known as an expansion chamber uses the pressure of the exhaust to create a pump that squeezes more air and fuel into the cylinder during the intake stroke. This provides greater power and fuel efficiency. See Kadenacy effect",
       "image1": "collectors1",
       "image2": "collectors2",
       "link": "https://en.wikipedia.org/wiki/Exhaust_system"
     },
     {
       "name": "Supercharger",
       "desc1": "A supercharger is an air compressor that increases the pressure or density of air supplied to an internal combustion engine",
       "desc2": "use for engines",
       "fullDesc": "In 1848 or 1849, G. Jones of Birmingham, England brought out a Roots-style compressor.[2]\n\nIn 1860, brothers Philander and Francis Marion Roots, founders of Roots Blower Company of Connersville, Indiana, patented the design for an air mover for use in blast furnaces and other industrial applications.\n\nThe world's first functional, actually tested[3] engine supercharger was made by Dugald Clerk, who used it for the first[4] two-stroke engine in 1878. Gottlieb Daimler received a German patent for supercharging an internal combustion engine in 1885.[5] Louis Renault patented a centrifugal supercharger in France in 1902. An early supercharged race car was built by Lee Chadwick of Pottstown, Pennsylvania in 1908 which reportedly reached a speed of 100 mph (160 km/h).\n\nThe world's first series-produced cars[6] with superchargers were Mercedes 6/25/40 hp and Mercedes 10/40/65 hp. Both models were introduced in 1921 and had Roots superchargers. They were distinguished as 'Kompressor' models, the origin of the Mercedes-Benz badging which continues today.\n\nOn March 24, 1878 Heinrich Krigar of Germany obtained patent #4121, patenting the first ever screw-type compressor.[7] Later that same year on August 16 he obtained patent #7116 after modifying and improving his original designs. His designs show a two-lobe rotor assembly with each rotor having the same shape as the other. Although the design resembled the Roots style compressor, the 'screws' were clearly shown with 180 degrees of twist along their length. Unfortunately, the technology of the time was not sufficient to produce such a unit, and Heinrich made no further progress with the screw compressor. Nearly half a century later, in 1935, Alf Lysholm, who was working for Ljungstroms Angturbin AB (later known as Svenska Rotor Maskiner AB or SRM in 1951), patented a design with five female and four male rotors. He also patented the method for machining the compressor rotors.",
       "image1": "compressor1",
       "image2": "compressor2",
       "link": "https://en.wikipedia.org/wiki/Supercharger"
     },
     {
       "name": "Gearbox",
       "desc1": "A transmission is a machine in a power transmission system, which provides controlled application of the power",
       "desc2": "have from 1 to 7 gears(in cars)",
       "fullDesc": "A transmission is a machine in a power transmission system, which provides controlled application of the power. Often the term transmission refers simply to the gearbox that uses gears and gear trains to provide speed and torque conversions from a rotating power source to another device.[1][2]\n\nIn British English, the term transmission refers to the whole drivetrain, including clutch, gearbox, prop shaft (for rear-wheel drive), differential, and final drive shafts. In American English, however, the term refers more specifically to the gearbox alone, and detailed usage differs.[note 1]\n\nThe most common use is in motor vehicles, where the transmission adapts the output of the internal combustion engine to the drive wheels. Such engines need to operate at a relatively high rotational speed, which is inappropriate for starting, stopping, and slower travel. The transmission reduces the higher engine speed to the slower wheel speed, increasing torque in the process. Transmissions are also used on pedal bicycles, fixed machines, and where different rotational speeds and torques are adapted.\n\nOften, a transmission has multiple gear ratios (or simply 'gears') with the ability to switch between them as speed varies. This switching may be done manually (by the operator) or automatically. Directional (forward and reverse) control may also be provided. Single-ratio transmissions also exist, which simply change the speed and torque (and sometimes direction) of motor output.\n\nIn motor vehicles, the transmission generally is connected to the engine crankshaft via a flywheel or clutch or fluid coupling, partly because internal combustion engines cannot run below a particular speed. The output of the transmission is transmitted via the driveshaft to one or more differentials, which drives the wheels. While a differential may also provide gear reduction, its primary purpose is to permit the wheels at either end of an axle to rotate at different speeds (essential to avoid wheel slippage on turns) as it changes the direction of rotation.\n\nConventional gear/belt transmissions are not the only mechanism for speed/torque adaptation. Alternative mechanisms include torque converters and power transformation (e.g. diesel-electric transmission and hydraulic drive system). Hybrid configurations also exist. Automatic transmissions use a valve body to shift gears using fluid pressures in conjunction with an ecm.",
       "image1": "gearbox1",
       "image2": "gearbox2",
       "link": "https://en.wikipedia.org/wiki/Transmission_(mechanics)"},
     {
       "name": "Intercooler",
       "desc1": "blowing air cooler",
       "desc2": "to cool blowing air",
       "fullDesc": "ntercoolers increase the efficiency of the induction system by reducing induction air heat created by the supercharger or turbocharger and promoting more thorough combustion. This removes the heat of compression (i.e., the temperature rise) that occurs in any gas when its pressure is raised (i.e. its unit mass per unit volume - density - is increased).\n\nA decrease in intake air charge temperature sustains use of a more dense intake charge into the engine, as a result of forced induction. The lowering of the intake charge air temperature also eliminates the danger of pre-detonation (knock) of the fuel/air charge prior to timed spark ignition. This preserves the benefits of more fuel/air burn per engine cycle, increasing the output of the engine.\n\nIntercoolers also eliminate the need for using the wasteful method of lowering intake charge temperature by the injection of excess fuel into the cylinders' air induction chambers, to cool the intake air charge, prior to its flowing into the cylinders. This wasteful practice (before intercoolers were used) nearly eliminated the gain in engine efficiency from forced induction, but was necessitated by the greater need to prevent at all costs the engine damage that pre-detonation engine knocking causes.[2]\n\nThe inter prefix in the device name originates from historic compressor designs. In the past, aircraft engines were built with charge air coolers that were installed between multiple stages of forced induction,[citation needed] thus the designation of inter. Modern automobile designs are technically designated aftercoolers because of their placement at the end of the supercharging chain. This term is now considered archaic in modern automobile terminology, since most forced-induction vehicles have single-stage superchargers or turbochargers, although 'aftercooler' is still in common use in the piston-engined aircraft industry. In a vehicle fitted with two-stage turbocharging, it is possible to have both an intercooler (between the two turbocharger units) and an aftercooler (between the second-stage turbo and the engine). The JCB Dieselmax land speed record-holding car is an example of such a system. In general, an intercooler or aftercooler is said to be a charge-air cooler.\n\nIntercoolers can vary dramatically in size, shape and design, depending on the performance and space requirements of the entire supercharger system. Common spatial designs are front mounted intercoolers (FMIC), top mounted intercoolers (TMIC) and hybrid mount intercoolers (HMIC). Each type can be cooled with an air-to-air system, air-to-liquid system, or a combination of both.",
       "image1": "intercooler1",
       "image2": "intercooler2",
       "link": "https://en.wikipedia.org/wiki/Intercooler"
     },
     {
       "name": "Suspension",
       "desc1": "Suspension is the system of tires, tire air, springs, shock absorbers and linkages",
       "desc2": "have a different springs types",
       "fullDesc": "n early form of suspension on ox-drawn carts had the platform swing on iron chains attached to the wheeled frame of the carriage. This system remained the basis for all suspension systems until the turn of the 19th century, although the iron chains were replaced with the use of leather straps by the 17th century. No modern automobiles use the 'strap suspension' system.\n\nAutomobiles were initially developed as self-propelled versions of horse-drawn vehicles. However, horse-drawn vehicles had been designed for relatively slow speeds, and their suspension was not well suited to the higher speeds permitted by the internal combustion engine.\n\nThe first workable spring-suspension required advanced metallurgical knowledge and skill, and only became possible with the advent of industrialisation. Obadiah Elliott registered the first patent for a spring-suspension vehicle; - each wheel had two durable steel leaf springs on each side and the body of the carriage was fixed directly to the springs which were attached to the axles. Within a decade, most British horse carriages were equipped with springs; wooden springs in the case of light one-horse vehicles to avoid taxation, and steel springs in larger vehicles. These were often made of low-carbon steel and usually took the form of multiple layer leaf springs.[3]\n\nLeaf springs have been around since the early Egyptians. Ancient military engineers used leaf springs in the form of bows to power their siege engines, with little success at first. The use of leaf springs in catapults was later refined and made to work years later. Springs were not only made of metal, a sturdy tree branch could be used as a spring, such as with a bow. Horse-drawn carriages and the Ford Model T used this system, and it is still used today in larger vehicles, mainly mounted in the rear suspension.[4]\n\nThis was the first modern suspension system and, along with advances in the construction of roads, heralded the single greatest improvement in road transport until the advent of the automobile.[5] The British steel springs were not well suited for use on America's rough roads of the time, so the Abbot-Downing Company of Concord, New Hampshire re-introduced leather strap suspension, which gave a swinging motion instead of the jolting up and down of a spring suspension.",
       "image1": "suspension1",
       "image2": "suspension2",
       "link": "https://en.wikipedia.org/wiki/Suspension_(vehicle)"
     },
     {
       "name": "Tires",
       "desc1": "To get a hookup",
       "desc2": "Have a different diameter",
       "fullDesc": "A tire (American English) or tyre (British English; see spelling differences) is a ring-shaped component that surrounds a wheel's rim to transfer a vehicle's load from the axle through the wheel to the ground and to provide traction on the surface traveled over. Most tires, such as those for automobiles and bicycles, are pneumatically inflated structures, which also provide a flexible cushion that absorbs shock as the tire rolls over rough features on the surface. Tires provide a footprint that is designed to match the weight of the vehicle with the bearing strength of the surface that it rolls over by providing a bearing pressure that will not deform the surface excessively.\n\nThe materials of modern pneumatic tires are synthetic rubber, natural rubber, fabric and wire, along with carbon black and other chemical compounds. They consist of a tread and a body. The tread provides traction while the body provides containment for a quantity of compressed air. Before rubber was developed, the first versions of tires were simply bands of metal fitted around wooden wheels to prevent wear and tear. Early rubber tires were solid (not pneumatic). Pneumatic tires are used on many types of vehicles, including cars, bicycles, motorcycles, buses, trucks, heavy equipment, and aircraft. Metal tires are still used on locomotives and railcars, and solid rubber (or other polymer) tires are still used in various non-automotive applications, such as some casters, carts, lawnmowers, and wheelbarrows.",
       "image1": "tire1",
       "image2": "tire2",
       "link": "https://en.wikipedia.org/wiki/Tire"
     },
     {
       "name": "Turbocharger",
       "desc1": "To get more compression",
       "desc2": "Have a systems(single, rwin, etc)",
       "fullDesc": "A turbocharger, or colloquially turbo, is a turbine-driven forced induction device that increases an internal combustion engine's efficiency and power output by forcing extra air into the combustion chamber.[1][2] This improvement over a naturally aspirated engine's power output is due to the fact that the compressor can force more air—and proportionately more fuel—into the combustion chamber than atmospheric pressure (and for that matter, ram air intakes) alone.\n\nTurbochargers were originally known as turbosuperchargers when all forced induction devices were classified as superchargers. Today the term 'supercharger' is typically applied only to mechanically driven forced induction devices. The key difference between a turbocharger and a conventional supercharger is that a supercharger is mechanically driven by the engine, often through a belt connected to the crankshaft, whereas a turbocharger is powered by a turbine driven by the engine's exhaust gas. Compared with a mechanically driven supercharger, turbochargers tend to be more efficient, but less responsive. Twincharger refers to an engine with both a supercharger and a turbocharger.\n\nTurbochargers are commonly used on truck, car, train, aircraft, and construction equipment engines. They are most often used with Otto cycle and Diesel cycle internal combustion engines. They have also been found useful in automotive fuel cells.[3]",
       "image1": "engine1",
       "image2": "engine2",
       "link": "https://en.wikipedia.org/wiki/Turbocharger"
     },
     {
       "name": "Wheels",
       "desc1": "A wheel is a circular rotate component",
       "desc2": "for movement",
       "fullDesc": "The invention of the wheel falls into the late Neolithic, and may be seen in conjunction with other technological advances that gave rise to the early Bronze Age. Note that this implies the passage of several wheel-less millennia even after the invention of agriculture and of pottery, during the Aceramic Neolithic (15713 BCE).\n\n    4500–3300 BCE: Chalcolithic, invention of the potter's wheel; earliest wooden wheels (disks with a hole for the axle); earliest wheeled vehicles, domestication of the horse\n    3300–2200 BCE: Early Bronze Age\n    2200–1550 BCE: Middle Bronze Age, invention of the spoked wheel and the chariot\n\nA depiction of an onager-drawn cart on the Sumerian 'battle standard of Ur' (c. 2500 BC)\nA figurine featuring the New World's independently invented wheel\n\nThe Halaf culture of 6500–5100 BCE is sometimes credited with the earliest depiction of a wheeled vehicle, but this is doubtful as there is no evidence of Halafians using either wheeled vehicles or even pottery wheels.[3]\n\nPrecursors of wheels, known as 'tournettes' or 'slow wheels', were known in the Middle East by the 5th millennium BCE (one of the earliest examples was discovered at Tepe Pardis, Iran, and dated to 5200–4700 BCE). These were made of stone or clay and secured to the ground with a peg in the center, but required significant effort to turn. True (freely-spinning) potter's wheels were apparently in use in Mesopotamia by 3500 BCE and possibly as early as 4000 BCE,[4] and the oldest surviving example, which was found in Ur (modern day Iraq), dates to approximately 3100 BCE.[5]\n\nThe first evidence of wheeled vehicles appears in the second half of the 4th millennium BCE, near-simultaneously in Mesopotamia (Sumerian civilization), the Northern Caucasus (Maykop culture) and Eastern Europe (Cucuteni-Trypillian culture), so the question of which culture originally invented the wheeled vehicle is still unsolved.\n\nThe earliest well-dated depiction of a wheeled vehicle (here a wagon — four wheels, two axles) is on the Bronocice pot, a c. 3500 – 3350 BCE clay pot excavated in a Funnelbeaker culture settlement in southern Poland.[6]\n\nThe oldest securely dated real wheel-axle combination, that from Stare Gmajne near Ljubljana in Slovenia (Ljubljana Marshes Wooden Wheel) is now dated within two standard deviations to 3340–3030 BCE, the axle to 3360–3045 BCE.[7]\n\nTwo types of early Neolithic European wheel and axle are known; a circumalpine type of wagon construction (the wheel and axle rotate together, as in Ljubljana Marshes Wheel), and that of the Baden culture in Hungary (axle does not rotate). They both are dated to c. 3200–3000 BCE.[8]\n\nIn China, the wheel was certainly present with the adoption of the chariot in c. 1200 BCE,[9] although Barbieri-Low[10] argues for earlier Chinese wheeled vehicles, c. 2000 BC.\n\nIn Britain, a large wooden wheel, measuring about 1 m (3.3 ft) in diameter, was uncovered at the Must Farm site in East Anglia in 2016. The specimen, dating from 1,100–800 years BCE, represents the most complete and earliest of its type found in Britain. The wheel's hub is also present. A horse's spine found nearby suggests the wheel may have been part of a horse-drawn cart. The wheel was found in a settlement built on stilts over wetland, indicating that the settlement had some sort of link to dry land.[11]",
       "image1": "wheels1",
       "image2": "wheels2",
       "link": "https://en.wikipedia.org/wiki/Wheel#Rim"
     },
     {
        "name": "ABS",
       "desc1": "anti-lock braking system",
       "desc2": "or anti-skid braking system",
       "fullDesc": "An anti-lock braking system or anti-skid braking system[1] (ABS) is an automobile safety system that allows the wheels on a motor vehicle to maintain tractive contact with the road surface according to driver inputs while braking, preventing the wheels from locking up (ceasing rotation) and avoiding uncontrolled skidding. It is an automated system that uses the principles of threshold braking and cadence braking which were practiced by skillful drivers with previous generation braking systems. It does this at a much faster rate and with better control than many drivers could manage.\n\nABS generally offers improved vehicle control and decreases stopping distances on dry and slippery surfaces; however, on loose gravel or snow-covered surfaces, ABS can significantly increase braking distance, although still improving vehicle steering control.[2][3][4]\n\nSince initial widespread use in production cars, anti-lock braking systems have been improved considerably. Recent versions not only prevent wheel lock under braking, but also electronically control the front-to-rear brake bias. This function, depending on its specific capabilities and implementation, is known as electronic brakeforce distribution (EBD), traction control system, emergency brake assist, or electronic stability control (ESC).",
       "image1": "abs1",
       "image2": "abs2",
       "link": "https://en.wikipedia.org/wiki/Anti-lock_braking_system"
     },
     {
        "name": "Strut bar",
       "desc1": "increase the strength of the body",
       "desc2": "increases controllability",
       "fullDesc": "Speaking about the advantages of the front strut, the following should be distinguished:\n\n    Low chance of cracks on the body due to long service life (age defects);\n    The vehicle keeps on the road much more confidently, it more accurately enters the turns, which is due to the increased level of rigidity;\n    The trajectory of the car becomes clearer and more precise;\n    Resistant to high loads and aggressive driving;\n    Increase the stability of the car with a straight ride;\n    No deformation of the body, when driving on uneven roads.\n\nIs the spacer so useful and does it need anything at all? In general, yes. Few motorists prefer the style of driving, like racing, but why not go through the usual turn not at a speed of 50 km per hour, but at 80 km per hour (the presence of a spacer).\n\nRegarding the disadvantages: the worst in the strut - increased damage to the car in case of an accident. If the blow is directed to the place where the spacer is installed, this will cause deformation and damage to both sides of the body. The accident may require significant financial waste (instead of repairing or replacing one side of the vehicle, you will have to replace the entire front end of the vehicle).",
       "image1": "strutBar1",
       "image2": "strutBar2",
       "link": "https://en.wikipedia.org/wiki/Strut_bar"
     },
     {
        "name": "Windshield",
       "desc1": "The front window",
       "desc2": "done from diferent materials",
       "fullDesc": "Early windshields were made of ordinary window glass, but that could lead to serious injuries in the event of a crash. A series of crashes led up to the development of stronger windshields. The most notable example of this is the Pane vs. Ford case of 1917 that decided against Pane in that he was only injured through reckless driving.[citation needed] They were replaced with windshields made of toughened glass and were fitted in the frame using a rubber or neoprene seal. The hardened glass shattered into many mostly harmless fragments when the windshield broke. These windshields, however, could shatter from a simple stone chip. In 1919, Henry Ford solved the problem of flying debris by using the new French technology of glass laminating. Windshields made using this process were two layers of glass with a cellulose inner layer. This inner layer held the glass together when it fractured. Between 1919 and 1929, Ford ordered the use of laminated glass on all of his vehicles.[2]\n\nModern, glued-in windshields contribute to the vehicle's rigidity, but the main force for innovation has historically been the need to prevent injury from sharp glass fragments. Almost all nations now require windshields to stay in one piece even if broken, except if pierced by a strong force. Properly installed automobile windshields are also essential to safety; along with the roof of the car, they provide protection to the vehicle's occupants in the case of a roll-over accident[citation needed].\n\nToday’s windshields are a safety device just like seatbelts and airbags. The installation of the auto glass is done with an automotive grade urethane designed specifically for automobiles. The adhesive creates a molecular bond between the glass and the vehicle. If the adhesive bond fails at any point on the glass it can reduce the effectiveness of the airbag and substantially compromise the structural integrity of the roof.[citation needed] The urethane sealant is protected from UV in sunlight by a band of dark dots around the edge of the windshield. The darkened edge transitions to the clear windshield with smaller dots to minimize thermal stress in manufacturing. The same band of darkened dots is often expanded around the rearview mirror to act as a sunshade.[3]",
       "image1": "windshield1",
       "image2": "windshield2",
       "link": "https://en.wikipedia.org/wiki/Windshield"
     },
     {
        "name": "Differential",
       "desc1": "to move wheels",
       "desc2": "rotated by cardan shaft",
       "fullDesc": "n automobiles and other wheeled vehicles, the differential allows the outer drive wheel to rotate faster than the inner drive wheel during a turn. This is necessary when the vehicle turns, making the wheel that is traveling around the outside of the turning curve roll farther and faster than the other. The average of the rotational speed of the two driving wheels equals the input rotational speed of the drive shaft. An increase in the speed of one wheel is balanced by a decrease in the speed of the other.\n\nWhen used in this way, a differential couples the longitudinal input shaft (or prop shaft) to the pinion, which in turn drives the transverse ring gear of the differential. This also works as reduction gearing. On rear wheel drive vehicles the differential may connect to half-shafts inside an axle housing, or drive shafts that connect to the rear driving wheels. Front wheel drive vehicles tend to have the engine crankshaft and the gearbox shafts transverse, and with the pinion on the end of the main-shaft of the gearbox and the differential enclosed in the same housing as the gearbox. There are individual drive-shafts to each wheel. A differential consists of one input, the drive shaft, and two outputs which are the two drive wheels, however the rotation of the drive wheels are coupled to each other by their connection to the roadway. Under normal conditions, with small tire slip, the ratio of the speeds of the two driving wheels is defined by the ratio of the radii of the paths around which the two wheels are rolling, which in turn is determined by the track-width of the vehicle (the distance between the driving wheels) and the radius of the turn.\n\nNon-automotive uses of differentials include performing analog arithmetic. Two of the differential's three shafts are made to rotate through angles that represent (are proportional to) two numbers, and the angle of the third shaft's rotation represents the sum or difference of the two input numbers. The earliest known use of a differential gear is in the Antikythera mechanism, circa 80 BCE, which used a differential gear to control a small sphere representing the moon from the difference between the sun and moon position pointers. The ball was painted black and white in hemispheres, and graphically showed the phase of the moon at a particular point in time.[1] An equation clock that used a differential for addition was made in 1720. In the 20th Century, large assemblies of many differentials were used as analog computers, calculating, for example, the direction in which a gun should be aimed. However, the development of electronic digital computers has made these uses of differentials obsolete. Military uses may still exist, for example, for a hypothetical computer designed to survive an electromagnetic pulse. Practically all the differentials that are now made are used in automobiles and similar vehicles.",
       "image1": "differential1",
       "image2": "differential2",
       "link": "https://en.wikipedia.org/wiki/Differential_(mechanical_device)"
     },
     {
        "name": "Drive shaft",
       "desc1": "mechanical component for transmitting",
       "desc2": "for torque ang rotation",
       "fullDesc": "The term drive shaft first appeared during the mid 19th century. In Stover's 1861 patent reissue for a planing and matching machine, the term is used to refer to the belt-driven shaft by which the machine is driven.[1] The term is not used in his original patent.[2] Another early use of the term occurs in the 1861 patent reissue for the Watkins and Bryson horse-drawn mowing machine.[3] Here, the term refers to the shaft transmitting power from the machine's wheels to the gear train that works the cutting mechanism.\n\nIn the 1890s, the term began to be used in a manner closer to the modern sense. In 1891, for example, Battles referred to the shaft between the transmission and driving trucks of his Climax locomotive as the drive shaft,[4] and Stillman referred to the shaft linking the crankshaft to the rear axle of his shaft-driven bicycle as a drive shaft.[5] In 1899, Bukey used the term to describe the shaft transmitting power from the wheel to the driven machinery by a universal joint in his Horse-Power.[6] In the same year, Clark described his Marine Velocipede using the term to refer to the gear-driven shaft transmitting power through a universal joint to the propeller shaft.[7] Crompton used the term to refer to the shaft between the transmission of his steam-powered Motor Vehicle of 1903 and the driven axle.[8]\n\nThe pioneering automobile industry company, Autocar, was the first to use a drive shaft in a gasoline-powered car. Built in 1901, today this vehicle is in the collection of the Smithsonian Institution.[9]",
       "image1": "shaft1",
       "image2": "shaft2",
       "link": "https://en.wikipedia.org/wiki/Drive_shaft"
     },
     {
        "name": "Fuel tank",
        "desc1": "need to keep a fuel",
        "desc2": "is a safe container",
        "fullDesc": "While most tanks are manufactured, some fuel tanks are still fabricated by metal craftsmen or hand-made in the case of bladder-style tanks. These include custom and restoration tanks for automotive, aircraft, motorcycles, and even tractors. Construction of fuel tanks follows a series of specific steps. The craftsman generally creates a mockup to determine the accurate size and shape of the tank, usually out of foam board. Next, design issues that affect the structure of the tank are addressed - such as where the outlet, drain, fluid level indicator, seams, and baffles go. Then the craftsmen must determine the thickness, temper and alloy of the sheet he will use to make the tank. After the sheet is cut to the shapes needed, various pieces are bent to create the basic shell and/or ends and baffles for the tank. Many fuel tanks' baffles (particularly in aircraft and racecars) contain lightening holes. These flanged holes serve two purposes, they reduce the weight of the tank while adding strength to the baffles. Toward the end of construction, openings are added for the filler neck, fuel pickup, drain, and fuel-level sending unit. Sometimes these holes are created on the flat shell, other times they are added at the end of the fabrication process. Baffles and ends can be riveted into place. The heads of the rivets are frequently brazed or soldered to prevent tank leaks. Ends can then be hemmed in and soldered, or flanged and brazed (and/or sealed with an epoxy-type sealant) or the ends can be flanged and then welded. Once the soldering, brazing or welding is complete, the fuel tank is leak-tested",
       "image1": "tank1",
       "image2": "tank2",
       "link": "https://en.wikipedia.org/wiki/Fuel_tank"
     }
     
     
]
}

